# prediction of salary based on multiple features

In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

![title](

In [2]:

d = pd.read_csv("hiring.csv")
d

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
d.experience = d.experience.fillna("zero")#all the elements in the series must be of same type
d

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
type(d.experience[0])

str

In [5]:
d.experience=d.experience.apply(w2n.word_to_num)

In [7]:
d

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [14]:
import math
mean_test_score=math.floor(d['test_score(out of 10)'].mean())
mean_test_score

7

In [15]:
d['test_score(out of 10)']=d['test_score(out of 10)'].fillna(mean_test_score)

In [16]:
d

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [17]:
mul_reg=linear_model.LinearRegression()

In [20]:
mul_reg.fit(d[['experience','test_score(out of 10)','interview_score(out of 10)']],d['salary($)'])

LinearRegression()

In [21]:
d[['experience']]#its the dataframe

   experience
0           0
1           0
2           5
3           2
4           7
5           3
6          10
7          11

In [23]:
d.experience#its dataseries also d['experience']

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [34]:
m=mul_reg.coef_
m

array([2922.26901502, 2221.30909959, 2147.48256637])

In [32]:
c=mul_reg.intercept_
c

14992.65144669314

In [36]:
#y=m1X1+m2X2+m3X3+c
print(f'model is {m[0]} X1 + {m[1]} X2 + {m[2]} X3 + {c}')

model is 2922.269015021056 X1 + 2221.309099589095 X2 + 2147.482566367157 X3 + 14992.65144669314

In [29]:
mul_reg.predict([[5,9,6]])

array([62480.6738163])

In [37]:
def prediction(exp,test,inter):
    print(f'predicted salary is',mul_reg.predict([[exp,test,inter]])[0])

In [38]:
prediction(2,6,7)

predicted salary is 49197.42203883992